# Step 1

## 01. Import Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

## 02. Set Paths and Import Data

In [4]:
path = r'C:\Users\Personal Computer\Documents\09.2022_Instacart_Basket_Analysis'

In [5]:
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'order_products__prior.csv'), index_col = False)

In [6]:
df_ords = pd.read_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'), index_col = False)

## 03. Check Dimesions of DataFrame

In [7]:
df_ords_prior

          order_id  product_id  add_to_cart_order  reordered
0                2       33120                  1          1
1                2       28985                  2          1
2                2        9327                  3          0
3                2       45918                  4          1
4                2       30035                  5          0
...            ...         ...                ...        ...
32434484   3421083       39678                  6          1
32434485   3421083       11352                  7          0
32434486   3421083        4600                  8          0
32434487   3421083       24852                  9          1
32434488   3421083        5020                 10          1

[32434489 rows x 4 columns]

In [8]:
# Check the output

In [9]:
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [10]:
df_ords_prior.shape

(32434489, 4)

In [11]:
df_ords.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,user_order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,0,2539329,1,1,2,8,NaN,yes
1,1,1,2398795,1,2,3,7,15.0,no
2,2,2,473747,1,3,3,12,21.0,no
3,3,3,2254736,1,4,4,7,29.0,no
4,4,4,431534,1,5,4,15,28.0,no

In [12]:
df_ords.shape

(3421083, 9)

In [13]:
## merge, new dataframe
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [12]:
df_merged_large.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,user_order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,NaN,yes,196,1,0,both
1,0,0,2539329,1,1,2,8,NaN,yes,14084,2,0,both
2,0,0,2539329,1,1,2,8,NaN,yes,12427,3,0,both
3,0,0,2539329,1,1,2,8,NaN,yes,26088,4,0,both
4,0,0,2539329,1,1,2,8,NaN,yes,26405,5,0,both

In [14]:
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

# Step 2

In [15]:
# Export data to pkl

df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))

In [16]:
# Export data to csv

df_merged_large.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.csv'))

# Step 3

### Note: The task instructions say to make a new notebook ... See Achievement 4, Exercise 6 (Part 2)